#ifndef C_DATE_YMD_CODE_H
#define C_DATE_YMD_CODE_H

//====================================================================================================
//класс работы с кодом даты (год-месяц-число)
//====================================================================================================

//====================================================================================================
//подключаемые библиотеки
//====================================================================================================

#include <stdint.h>
#include <stdio.h>
#include <string>

#include "cdvtime.h"

//====================================================================================================
//класс работы с кодом даты (год-месяц-число)
//====================================================================================================
class CDateYMDCode
{
 public:
  //-Перечисления---------------------------------------------------------------------------------------
  //идентификатор
  enum DATE_YMD_CODE_VALUE
  {
   DATE_YMD_CODE_VIDEO_ID=0x62,
   DATE_YMD_CODE_AUDIO_ID=0x52
  };
  //-Структуры------------------------------------------------------------------------------------------
  #pragma pack(1)
  //код даты (формат двоично-десятичный)
  struct SDateYMDCode
  {
   //байт 0
   uint8_t ID;//идентификатор
   //байт 1
   uint8_t Res1;//зарезервировано (все биты в 1)
   //байт 2
   uint8_t UnitsOfDay:4;//единицы дня
   uint8_t TensOfDay:2;//десятки дня
   uint8_t Res2:2;//зарезервировано
   //байт 3
   uint8_t UnitsOfMonth:4;//единицы месяца
   uint8_t TensOfMonth:1;//десятки месяца
   uint8_t Res3:3;//зарезервировано
   //байт 4
   uint8_t UnitsOfYear:4;//единицы последних цифр года
   uint8_t TensOfYear:4;//десятки цифр года
  };
  #pragma pack()

 private:
  //-Переменные-----------------------------------------------------------------------------------------  
 public:
  //-Конструктор класса---------------------------------------------------------------------------------
  CDateYMDCode(void);
  //-Деструктор класса----------------------------------------------------------------------------------
  ~CDateYMDCode();
 public:
  //-Открытые функции класса----------------------------------------------------------------------------
  void SetVideo(SDateYMDCode *sDateYMDCode_Ptr,const CDVTime &cDVTime);//задать блок кода даты для видео данных
  void SetAudio(SDateYMDCode *sDateYMDCode_Ptr,const CDVTime &cDVTime);//задать блок кода даты для аудио данных  
  void OutputToFile(FILE *file,const std::string &prefix,SDateYMDCode *sDateYMDCode_Ptr);//вывести в файл параметры кода даты
  //-Закрытые функции класса----------------------------------------------------------------------------
  void Set(SDateYMDCode *sDateYMDCode_Ptr,uint8_t id,const CDVTime &cDVTime);//задать блок кода даты
};

#endif
