#ifndef C_DATE_HMS_CODE_H
#define C_DATE_HMS_CODE_H

//====================================================================================================
//класс работы с кодом даты (час-минута-секунда)
//====================================================================================================

//====================================================================================================
//подключаемые библиотеки
//====================================================================================================

#include <stdint.h>
#include <stdio.h>
#include <string>

#include "cdvtime.h"

//====================================================================================================
//класс работы с кодом даты (час-минута-секунда)
//====================================================================================================
class CDateHMSCode
{
 public:
  //-ѕеречислени€---------------------------------------------------------------------------------------
  //идентификатор
  enum DATE_HMS_CODE_VALUE
  {
   DATE_HMS_CODE_VIDEO_ID=0x63,
   DATE_HMS_CODE_AUDIO_ID=0x53
  };
  //-—труктуры------------------------------------------------------------------------------------------
  #pragma pack(1)
  //код даты (формат двоично-дес€тичный)
  struct SDateHMSCode
  {
   //байт 0
   uint8_t ID;//идентификатор
   //байт 1
   uint8_t Res1;//зарезервировано (все биты в 1)
   //байт 2
   uint8_t UnitsOfSecond:4;//единицы секунд
   uint8_t TensOfSecond:3;//дес€тки секунд
   uint8_t Res2:1;//зарезервировано (все биты в 1)
   //байт 3
   uint8_t UnitsOfMinutes:4;//единицы минут
   uint8_t TensOfMinutes:3;//дес€тки минут
   uint8_t Res3:1;//зарезервировано (все биты в 1)
   //байт 4
   uint8_t UnitsOfHours:4;//единицы часов
   uint8_t TensOfHours:2;//дес€тки часов
   uint8_t Res4:2;//зарезервировано (все биты в 1)
  };
  #pragma pack()

 private:
  //-ѕеременные-----------------------------------------------------------------------------------------  
 public:
  //- онструктор класса---------------------------------------------------------------------------------
  CDateHMSCode(void);
  //-ƒеструктор класса----------------------------------------------------------------------------------
  ~CDateHMSCode();
 public:
  //-ќткрытые функции класса----------------------------------------------------------------------------
  void SetVideo(SDateHMSCode *sDateHMSCode_Ptr,const CDVTime &cDVTime);//задать блок кода даты дл€ видео данных
  void SetAudio(SDateHMSCode *sDateHMSCode_Ptr,const CDVTime &cDVTime);//задать блок кода даты аудио данных
  void OutputToFile(FILE *file,const std::string &prefix,SDateHMSCode *sDateHMSCode_Ptr);//вывести в файл параметры кода даты
  //-«акрытые функции класса----------------------------------------------------------------------------
  void Set(SDateHMSCode *sDateHMSCode_Ptr,uint8_t id,const CDVTime &cDVTime);//задать блок кода даты
};

#endif
