#ifndef C_DIALOG_EXTRACT_H
#define C_DIALOG_EXTRACT_H

//====================================================================================================
//описание
//====================================================================================================

//Класс диалога настройки извелечения файлов из DV-видеофайла

//====================================================================================================
//подключаемые библиотеки
//====================================================================================================
#include "stdafx.h"
#include <string>
#include <stdint.h>

//====================================================================================================
//Класс диалога настройки извелечения файлов из DV-видеофайла
//====================================================================================================
class CDialog_Extract:public CDialog
{
 public:
  //-Структуры------------------------------------------------------------------------------------------
  struct SExtractSettings
  {
   std::string DVFileName;//имя входного файла DV
   std::string Path;//папка, в которую будут извлечены файлы
  };
 protected:
  //-Переменные-----------------------------------------------------------------------------------------  
  SExtractSettings sExtractSettings_Local;//редактируемые настройки
  static const uint32_t MAX_FILE_NAME_TEXT=MAX_PATH;//максимальный размер строки для имени файла/каталога
 public:
  //-Конструктор класса---------------------------------------------------------------------------------
  CDialog_Extract(LPCTSTR lpszTemplateName,CWnd* pParentWnd);
  //-Деструктор класса----------------------------------------------------------------------------------
  ~CDialog_Extract();
 public:
  //-Открытые функции класса----------------------------------------------------------------------------
  afx_msg void OnOK(void);//нажали Enter
  afx_msg void OnCancel(void);//нажали ESC
  afx_msg BOOL OnInitDialog(void);//инициализация диалога
  bool Activate(SExtractSettings& sExtractSettings);//запустить диалог
  //-Функции обработки сообщений класса-----------------------------------------------------------------
  DECLARE_MESSAGE_MAP()
  afx_msg void OnDestroy(void);//уничтожение окна
  afx_msg void OnCommand_Button_PathSelect(void);//выбрать папку
  afx_msg void OnCommand_Button_DVSelect(void);//выбрать dv-файл
  afx_msg void OnCommand_Button_Ok(void);//применить настройки
  afx_msg void OnCommand_Button_Cancel(void);//отменить настройки
 protected:
  //-Закрытые функции класса----------------------------------------------------------------------------
};
#endif