#ifndef C_DIALOG_INSERT_H
#define C_DIALOG_INSERT_H

//====================================================================================================
//описание
//====================================================================================================

//Класс диалога настройки сборки DV-видеофайла

//====================================================================================================
//подключаемые библиотеки
//====================================================================================================
#include "stdafx.h"
#include <string>
#include <stdint.h>

//====================================================================================================
//Класс диалога настройки сборки DV-видеофайла
//====================================================================================================
class CDialog_Insert:public CDialog
{
 public:
  //-Структуры------------------------------------------------------------------------------------------
  struct SInsertSettings
  {
   std::string LogoFileName;//имя файла логотипа
   std::string DVFileName;//имя выходного файла DV
   std::string Path;//папка, файлы которой будут собраны в DV-файл
   uint32_t GlobalPrefix;//глобальный префикс (перед всем видеофайлом)
   uint32_t LocalPrefix;//локальный префика (перед каждым файлом)
  };
 protected:
  //-Переменные-----------------------------------------------------------------------------------------  
  SInsertSettings sInsertSettings_Local;//редактируемые настройки
  static const uint32_t MAX_PREFIX_TEXT=10;//максимальный размер строки для префикса
  static const uint32_t MAX_FILE_NAME_TEXT=MAX_PATH;//максимальный размер строки для имени файла/каталога
 public:
  //-Конструктор класса---------------------------------------------------------------------------------
  CDialog_Insert(LPCTSTR lpszTemplateName,CWnd* pParentWnd);
  //-Деструктор класса----------------------------------------------------------------------------------
  ~CDialog_Insert();
 public:
  //-Открытые функции класса----------------------------------------------------------------------------
  afx_msg void OnOK(void);//нажали Enter
  afx_msg void OnCancel(void);//нажали ESC
  afx_msg BOOL OnInitDialog(void);//инициализация диалога
  bool Activate(SInsertSettings& sInsertSettings);//запустить диалог
  //-Функции обработки сообщений класса-----------------------------------------------------------------
  DECLARE_MESSAGE_MAP()
  afx_msg void OnDestroy(void);//уничтожение окна
  afx_msg void OnCommand_Button_LogoSelect(void);//выбрать файл логотипа
  afx_msg void OnCommand_Button_PathSelect(void);//выбрать папку
  afx_msg void OnCommand_Button_DVSelect(void);//выбрать dv-файл
  afx_msg void OnCommand_Button_Ok(void);//применить настройки
  afx_msg void OnCommand_Button_Cancel(void);//отменить настройки
 protected:
  //-Закрытые функции класса----------------------------------------------------------------------------
};
#endif