#ifndef C_DOCUMENT_MAIN_H
#define C_DOCUMENT_MAIN_H

//====================================================================================================
//описание
//====================================================================================================

//Класс документа

//====================================================================================================
//подключаемые библиотеки
//====================================================================================================
#include <string>

#include "stdafx.h"
#include "cmain.h"
#include "cdialog_insert.h"
#include "cdialog_extract.h"

//====================================================================================================
//класс документов
//====================================================================================================

class CDocument_Main:public CDocument
{
 protected:
  //-Переменные-----------------------------------------------------------------------------------------
  std::unique_ptr<CMain> cMain_Ptr;//указатель на основной класс программы
 public:
  //-Конструктор класса---------------------------------------------------------------------------------
  CDocument_Main(void);
  //-Деструктор класса----------------------------------------------------------------------------------
  ~CDocument_Main();
 public:
  //-Открытые функции класса----------------------------------------------------------------------------  
  afx_msg void Insert(const CDialog_Insert::SInsertSettings &sInsertSettings);//добавить файлы в dv-видеофайл
  afx_msg void Extract(const CDialog_Extract::SExtractSettings &sExtractSettings);//извлечь файлы из dv-видеофайла
  afx_msg void Verify(const CDialog_Extract::SExtractSettings &sExtractSettings);//проверить файлы в dv-видеофайле
  afx_msg void Break(void);//прервать обработку
  afx_msg void OnTimer(void);//событие таймера
  void GetAndClearAnswer(std::string &answer);//получить ответ и очистить его
  bool IsProcessing(void);//получить, производится ли обработка
 private:
  //-Закрытые функции класса----------------------------------------------------------------------------  
  //-Прочее---------------------------------------------------------------------------------------------
  DECLARE_DYNCREATE(CDocument_Main) 
  DECLARE_MESSAGE_MAP()
};

#endif
