#include "cdocument_main.h"

BEGIN_MESSAGE_MAP(CDocument_Main,CDocument)
END_MESSAGE_MAP()

//====================================================================================================
//конструктор класса
//====================================================================================================
CDocument_Main::CDocument_Main(void):cMain_Ptr(new CMain) 
{
}
//====================================================================================================
//деструктор класса
//====================================================================================================
CDocument_Main::~CDocument_Main() 
{
}

//====================================================================================================
//закрытые функции класса
//====================================================================================================

//====================================================================================================
//открытые функции класса
//====================================================================================================

//----------------------------------------------------------------------------------------------------
//добавить файлы в dv-видеофайл
//----------------------------------------------------------------------------------------------------
afx_msg void CDocument_Main::Insert(const CDialog_Insert::SInsertSettings &sInsertSettings)
{ 
 CDVTime cDVTime;
 SYSTEMTIME st;
 GetLocalTime(&st);
 
 cDVTime.Set(st.wYear,static_cast<uint8_t>(st.wMonth),static_cast<uint8_t>(st.wDay),static_cast<uint8_t>(st.wHour),static_cast<uint8_t>(st.wMinute),static_cast<uint8_t>(st.wSecond));

 cMain_Ptr->InsertData(cDVTime,sInsertSettings);
}
//----------------------------------------------------------------------------------------------------
//извлечь файлы из dv-видеофайла
//----------------------------------------------------------------------------------------------------
afx_msg void CDocument_Main::Extract(const CDialog_Extract::SExtractSettings &sExtractSettings)
{
 cMain_Ptr->ExtractData(sExtractSettings);
}
//----------------------------------------------------------------------------------------------------
//проверить файлы в dv-видеофайле
//----------------------------------------------------------------------------------------------------
afx_msg void CDocument_Main::Verify(const CDialog_Extract::SExtractSettings &sExtractSettings)
{
 cMain_Ptr->VerifyData(sExtractSettings);
}
//----------------------------------------------------------------------------------------------------
//прервать обработку
//----------------------------------------------------------------------------------------------------
afx_msg void CDocument_Main::Break(void)
{
 cMain_Ptr->Break();
}
//----------------------------------------------------------------------------------------------------
//событие таймера
//----------------------------------------------------------------------------------------------------
afx_msg void CDocument_Main::OnTimer(void)
{
 UpdateAllViews(NULL);
}
//----------------------------------------------------------------------------------------------------
//получить ответ и очистить его
//----------------------------------------------------------------------------------------------------
void CDocument_Main::GetAndClearAnswer(std::string &answer)
{ 
 cMain_Ptr->GetAndClearAnswer(answer);
}
//----------------------------------------------------------------------------------------------------
//получить, производится ли обработка
//----------------------------------------------------------------------------------------------------
bool CDocument_Main::IsProcessing(void)
{
 return(cMain_Ptr->IsProcessing());
}

//====================================================================================================
//прочее
//====================================================================================================
IMPLEMENT_DYNCREATE(CDocument_Main,CDocument)
