#ifndef C_DV_TIME_H
#define C_DV_TIME_H

//====================================================================================================
//класс работы с временем
//====================================================================================================

//====================================================================================================
//подключаемые библиотеки
//====================================================================================================

#include <stdint.h>

//====================================================================================================
//класс работы с временем
//====================================================================================================
class CDVTime
{
 public:
  //-Перечисления---------------------------------------------------------------------------------------
  //-Структуры------------------------------------------------------------------------------------------
 private:
  //-Переменные-----------------------------------------------------------------------------------------  
  uint16_t Year;//год
  uint8_t Month;//месяц
  uint8_t Day;//число
  uint8_t Hour;//час
  uint8_t Min;//минуты
  uint8_t Sec;//секунды
 public:
 static const int32_t PAL_FRAME_RATE=25;
 static const int32_t NTSC_FRAME_RATE=30; 
 public:
  //-Конструктор класса---------------------------------------------------------------------------------
  CDVTime(void);
  //-Деструктор класса----------------------------------------------------------------------------------
  ~CDVTime();
 public:
  //-Открытые функции класса----------------------------------------------------------------------------
  void Set(uint16_t year,uint8_t month,uint8_t day,uint8_t hour,uint8_t min,uint8_t sec);//задать время
  void Get(uint16_t &year,uint8_t &month,uint8_t &day,uint8_t &hour,uint8_t &min,uint8_t &sec) const;//получить время
  void AddSecond(void);//прошла одна секунда
  static uint8_t CreateBCD(uint8_t value);//перевести значение в двоично-десятичный код
  //-Закрытые функции класса----------------------------------------------------------------------------
};

#endif
