#ifndef C_DV_VIDEO_H
#define C_DV_VIDEO_H

//====================================================================================================
//класс работы с секцией video для dv-формата
//====================================================================================================

//====================================================================================================
//подключаемые библиотеки
//====================================================================================================

#include <stdint.h>

#include "cdvdifid.h"

//====================================================================================================
//класс работы с секцией video для dv-формата
//====================================================================================================
class CDVVideo
{
 public:
  //-Перечисления---------------------------------------------------------------------------------------
  //-Структуры------------------------------------------------------------------------------------------
  //биты внутри байта структуры заполняются от младшего к старшему! В документации они приведены наоборот!
  #pragma pack(1)
  //данные видео
  struct SVideo
  {
   CDVDIFID::SDIFID sDIFID;//идентификатор DIF-блока
   uint8_t VideoData[80-sizeof(CDVDIFID::SDIFID)];//данные видео
  };
  #pragma pack()
 private:
  //-Переменные-----------------------------------------------------------------------------------------  
  CDVDIFID cDVDIFID;
 public:
  //-Конструктор класса---------------------------------------------------------------------------------
  CDVVideo(void);
  //-Деструктор класса----------------------------------------------------------------------------------
  ~CDVVideo();
 public:
  //-Открытые функции класса----------------------------------------------------------------------------
  void Set(SVideo *sVideo_Ptr,uint8_t dif_sequence,uint8_t block_number);//задать секцию Video
  void OutputToFile(FILE *file,const std::string &prefix,SVideo *sVideo_Ptr);//вывести в файл параметры секции
  static uint32_t GetSectionSize(void);//получить размер секции в байтах
  //-Закрытые функции класса----------------------------------------------------------------------------
};

#endif
