#ifndef CFRAMEWND_MAIN_H
#define CFRAMEWND_MAIN_H

//====================================================================================================
//описание
//====================================================================================================

//Класс рамки окна

//====================================================================================================
//подключаемые библиотеки
//====================================================================================================
#include <stdint.h>
#include "stdafx.h"
#include "cdocument_main.h"
#include "clistview_main.h"
#include "cdialog_insert.h"
#include "cdialog_extract.h"

//====================================================================================================
//класс рамки окна
//====================================================================================================
class CFrameWnd_Main:public CFrameWnd
{
 private:
  //-Переменные-----------------------------------------------------------------------------------------
  static const uint32_t TIMER_PERIOD_MS=100;//период таймера
  static const uint32_t ID_TIMER_MAIN=1000;//идентификатор таймера

  static const uint32_t TOOLBAR_MAIN_BUTTON_AMOUNT=11;//количество кнопок в панели инструментов

  CDialog_Insert::SInsertSettings sInsertSettings;//настройки сборки
  CDialog_Extract::SExtractSettings sExtractSettings;//настройки извлечения

  bool LastProcessingState;//последнее значение "выполняется обработка"

  CStatusBar cStatusBar_Main;//строка состояния
  CToolBar cToolBar_Main;//панель инструментов

  HICON hIcon;//иконка
 public:
  //-Конструктор класса---------------------------------------------------------------------------------
  CFrameWnd_Main(void);
  //-Деструктор класса----------------------------------------------------------------------------------
  ~CFrameWnd_Main();
 public:
  //-Открытые функции класса----------------------------------------------------------------------------  
  afx_msg int OnCreate(LPCREATESTRUCT lpCreateStruct);//создание рамки
  afx_msg void OnDestroy(void);//уничтожение рамки
  afx_msg void OnTimer(UINT nIDEvent);//событие таймера
  //-Функции обработки сообщений класса-----------------------------------------------------------------
  DECLARE_MESSAGE_MAP()
  afx_msg void OnCommand_ToolBar_Main_Insert(void);//нажата кнопка "Собрать файлы в DV-видеофайл" главной панели инструментов 
  afx_msg void OnCommand_ToolBar_Main_Extract(void);//нажата кнопка "Извлечь файлы из DV-видеофайла" главной панели инструментов 
  afx_msg void OnCommand_ToolBar_Main_Stop(void);//нажата кнопка "Остановить обработку" главной панели инструментов 
  afx_msg void OnCommand_ToolBar_Main_Verify(void);//нажата кнопка "Проверить файлы в DV-видеофайле" главной панели инструментов 
  afx_msg void OnCommand_ToolBar_Main_Clear(void);//нажата кнопка "очистить статистику" главной панели инструментов 
  //-Прочее---------------------------------------------------------------------------------------------
  DECLARE_DYNCREATE(CFrameWnd_Main) 
};
#endif