#ifndef C_LISTVIEW_MAIN_H
#define C_LISTVIEW_MAIN_H

//====================================================================================================
//описание
//====================================================================================================

//Класс отображаемого списка

//====================================================================================================
//подключаемые библиотеки
//====================================================================================================

#include "stdafx.h"
#include "cdocument_main.h"

//====================================================================================================
//класс представления
//====================================================================================================

class CListView_Main:public CListView
{
 protected: 
  //-Переменные-----------------------------------------------------------------------------------------
 public:
  //-Конструктор класса---------------------------------------------------------------------------------
  CListView_Main();
  //-Деструктор класса----------------------------------------------------------------------------------
  ~CListView_Main();
 public:
  //-Открытые функции класса----------------------------------------------------------------------------  
  afx_msg void OnInitialUpdate(void);//создание окна
  //-Функции обработки сообщений класса-----------------------------------------------------------------
  afx_msg void OnSize(UINT nType,int cx,int cy);//изменение размеров окна
  afx_msg void OnUpdate(CView *pSender,LPARAM lHint,CObject *pHint);//обновить вид
  DECLARE_MESSAGE_MAP()
 public:
  //-Открытые функции класса----------------------------------------------------------------------------  
  void UpdateList(void);//обновить список
 protected:
  //-Закрытые функции класса----------------------------------------------------------------------------  
  CDocument_Main* GetDocument(void);//получить документ
  //-Прочее---------------------------------------------------------------------------------------------
  DECLARE_DYNCREATE(CListView_Main)
  
};
#endif