#ifndef I_OUTPUT_DV_STREAM_H
#define I_OUTPUT_DV_STREAM_H

//====================================================================================================
//интерфейсный класс потока вывода данных DV
//====================================================================================================

//====================================================================================================
//подключаемые библиотеки
//====================================================================================================
#include <stdint.h>
#include <string>

//====================================================================================================
//интерфейсный класс потока вывода данных DV
//====================================================================================================
class IOutputDVStream
{
 private:
  //-Переменные класса----------------------------------------------------------------------------------
public:
  //-Конструктор класса---------------------------------------------------------------------------------
  //-Деструктор класса----------------------------------------------------------------------------------
  virtual ~IOutputDVStream() {};
 public:
  //-Открытые функции класса----------------------------------------------------------------------------
  virtual bool AddFrame(uint8_t *frame_buffer,size_t size)=0;//добавить кадр
  virtual bool Create(const std::string &file_name)=0;//создать файл
  virtual void Close(void)=0;//закрыть файл
  virtual void AddAnswer(const std::string &answer)=0;//добавить к ответу строку
  virtual bool IsExit(void)=0;//нужно ли завершать обработку
  virtual void GetAnswer(std::string &answer)=0;//получить ответ
  virtual void ClearAnswer(void)=0;//очистить ответ
  virtual void SetExit(bool state)=0;//задать, требуется ли завершение работы
};

#endif
